{
    "queries":
    {
        "simple": [
            "Say 'Hi'. Keep your answer short.",
            "What is your name? Keep your answer short.",
            "What is 29 * 5.5? Keep your answer short.",
            "What is the capital of France?",
            "Who wrote 1984?",
            "When did World War I begin?",
            "What is the largest planet in our solar system?",
            "How many states are in the USA?",
            "Who was the first president of the United States?",
            "What is the freezing point of water in Celsius?",
            "What is the square root of 16?",
            "Who discovered gravity?",
            "Which technology was developed most recently? (A) cellular telephone (B) television (C) refrigerator (D) airplane",
            "Which of these scientific advances occurred first? (A) the invention of the telescope (B) the building of submarines (C) the generation of electricity (D) the breeding of plants",
            "After a rainfall, which process in the water cycle draws the water back up into the air? (A) condensation (B) evaporation (C) circulation (D) precipitation",
            "How is a pond different from a lake? (A) Ponds have moving water. (B) Ponds are smaller and shallower. (C) Ponds are not surrounded by land. (D) Ponds have a different amount of salt.",
            "Which kind of events can form mountains? (A) earthquakes and volcanoes (B) earthquakes and landslides (C) landslides and avalanches (D) volcanoes and avalanches",
            "Jeannie put her soccer ball on the ground on the side of a hill. What force acted on the soccer ball to make it roll down the hill? (A) gravity (B) electricity (C) friction (D) magnetism",
            "Many animals blend in with their environment and can not be easily seen by predators. This is an example of which adaptation? (A) communicating (B) hibernating (C) migrating (D) camouflaging",
            "Which is made by plants to attract pollinators to flowers? (A) sap (B) oxygen (C) nectar (D) carbon dioxide"
        ],
        "intermediate": [
            "How do I make a cup of tea?",
            "What is the capital of Italy?",
            "Explain how a car engine works.",
            "Write a simple Python function to add two numbers.",
            "How do neural networks learn?",
            "What are the benefits of renewable energy?",
            "Explain the concept of artificial intelligence.",
            "What is the difference between a virus and bacteria?",
            "Describe the process of cellular respiration.",
            "What is the role of mitochondria in cells?",
            "How does the water cycle function?",
            "What are the main principles of supply and demand?",
            "What is the greenhouse effect, and how does it contribute to global warming?",
            "India is in the Northern Hemisphere and Australia is in the Southern Hemisphere. In June, it is summer in India and winter in Australia. What is the main reason the seasons are opposite in the two countries? (A) because Earth is tilted on its axis (B) because the Sun rotates on its axis (C) because Earth revolves around the Sun (D) because of the distance between the countries",
            "Organisms contain DNA. What makes prokaryotic DNA different from eukaryotic DNA? (A) the molecular shape (B) the types of bases (C) the sugar composition (D) the presence of phosphates",
            "After fossils are formed, which process is most likely to destroy them?  (A) the carbon cycle (B) the nitrogen cycle (C) the water cycle (D) the rock cycle",
            "Which statement best describes the semiconservative replication sequence of the DNA sequence CCGCAT? (A) identical bases in the same order (B) complementary bases in the same order (C) identical bases in the reverse order (D) complementary bases in the reverse order",
            "A population of plants growing on an island consisted of two varieties, one with thorns and the other without. Over a period of many years, the variety with thorns gradually disappeared. Which process most likely brought about this change in the plant population? (A) gene flow (B) genetic drift (C) natural selection (D) random mutation",
            "When placed in a glucose solution, yeast cells will produce bubbles. Which process are the yeast cells carrying out?  (A) chemosynthesis (B) photosynthesis (C) respiration (D) transpiration",
            "Which characteristic is exclusive to chordates? (A) digestive tract with two openings (B) dorsal hollow nerve tube (C) closed circulatory system (D) bony internal skeleton"
        ],
        "complex": [
            "Summarize the plot of 'To Kill a Mockingbird'.",
            "Discuss the impact of globalization on emerging markets.",
            "Analyze the ethical implications of artificial intelligence in modern society.",
            "Explain the history and impact of the Industrial Revolution on global economies.",
            "Explain the theory of relativity and how it has transformed our understanding of space and time.",
            "Explain the many-worlds interpretation of quantum mechanics.",
            "What is the role of government regulation in the economy, and how does it impact business practices in Canada?",
            "How does the human brain process information, and what is the role of neurotransmitters in brain function?",
            "Approximately 50 million acres of tropical rainforest are cleared each year. Which effect most likely would result from the clearing of these forests? (A) a decrease in soil erosion (B) a decrease in biodiversity (C) an improvement in air quality (D) an improvement in water quality",
            "A volcano erupts and covers the surrounding area with lava and volcanic ash. As the ecosystem begins to recover, which type of plant will most likely be the first to colonize land in the area surrounding the eruption? (A) mosses (B) wildflowers (C) hardwood trees (D) evergreen shrubs"
        ]
    }
  }  